; domain
(define (domain cat)
    (:requirements :strips)
    (:types cat mouse wall trap square)
    (:predicates
        (at ?who ?where)
        (adj ?s1 ?s2 - square)
        (dead ?m)
        (has ?who ?what)
    )

    (:action move
        :parameters (?c - cat ?s1 - square ?s2 - square)
        :precondition (and 
            (not (dead ?c))
            (adj ?s1 ?s2)
            (at ?c ?s1)
            (not (exists (?w - wall) (at ?w ?s2)))
        )
        :effect (and 
            (not (at ?c ?s1))
            (when (exists (?t - trap) (at ?t ?s2)) (dead ?c))
            (when (not(exists (?t - trap) (at ?t ?s2))) (at ?c ?s2))
        )
    )
  
    (:action eat
        :parameters (?c - cat ?s - square ?m - mouse)
        :precondition (and 
            (not (dead ?c))
            (at ?m ?s) 
            (at ?c ?s)
            (not (exists (?m1 - mouse) (has ?c ?m1)))
        )
        :effect (and 
            (not (at ?m ?s)) 
            (dead ?m)
        )
    )

    (:action grab
        :parameters (?c - cat ?s - square ?m - mouse)
        :precondition (and 
            (not (dead ?c))
            (at ?m ?s) 
            (at ?c ?s)
            (not (exists (?m1 - mouse) (has ?c ?m1)))
        )
        :effect (and 
            (not (at ?m ?s)) 
            (has ?c ?m)
        )
    )

    (:action disable-trap
        :parameters (?c - cat ?s1 - square ?s2 - square ?m - mouse ?t - trap)
        :precondition (and 
            (not (dead ?c))
            (adj ?s1 ?s2)
            (at ?c ?s1)
            (at ?t ?s2)
            (has ?c ?m) 
        )
        :effect (and 
            (not (at ?t ?s2)) 
            (dead ?m)
            (not (has ?c ?m))
        )
    )

    (:action drop
        :parameters (?c - cat ?s - square ?s2 - square ?m - mouse)
        :precondition (and 
            (not (dead ?c))
            (has ?c ?m) 
            (at ?c ?s)
            (adj ?s ?s2)
        )
        :effect (and 
            (not (has ?c ?m))            
            (at ?m ?s2)
        )
    )
)

; problem
(define (problem cat-p01)
    (:domain cat)
    (:objects
        c - cat
        m1 m2 - mouse
        s11 s12 s13 s14
        s21 s22 s23 s24
        s31 s32 s33 s34
        s41 s42 s43 s44
        - square
    )

    (:init
        ; square adjacency
        (adj s11 s12) (adj s12 s11)
        (adj s11 s21) (adj s21 s11)
        (adj s12 s13) (adj s13 s12)
        (adj s12 s22) (adj s22 s12)
        (adj s13 s14) (adj s14 s13)
        (adj s13 s23) (adj s23 s13)
        (adj s14 s24) (adj s24 s14)
        (adj s21 s22) (adj s22 s21)
        (adj s21 s31) (adj s31 s21)
        (adj s22 s23) (adj s23 s22)
        (adj s22 s32) (adj s32 s22)
        (adj s23 s24) (adj s24 s23)
        (adj s23 s33) (adj s33 s23)
        (adj s24 s34) (adj s34 s24)
        (adj s31 s32) (adj s32 s31)
        (adj s31 s41) (adj s41 s31)
        (adj s32 s33) (adj s33 s32)
        (adj s32 s42) (adj s42 s32)
        (adj s33 s34) (adj s34 s33)
        (adj s33 s43) (adj s43 s33)
        (adj s34 s44) (adj s44 s34)
        (adj s41 s42) (adj s42 s41)
        (adj s42 s43) (adj s43 s42)
        (adj s43 s44) (adj s44 s43)

        ; cat
        (at c s11)

        ; mice
        (at m1 s31)
        (at m2 s24)
    )

    (:goal (and (dead m1) (dead m2)))
)

; plan
1. (move c s11 s21)
   deleted: (at c s11)
   added: (at c s21)
   goals met: 0 of 2
2. (move c s21 s31)
   deleted: (at c s21)
   added: (at c s31)
   goals met: 0 of 2
3. (eat c s31 m1)
   deleted: (at m1 s31)
   added: (dead m1)
   goals met: 1 of 2
4. (move c s31 s21)
   deleted: (at c s31)
   added: (at c s21)
   goals met: 1 of 2
5. (move c s21 s22)
   deleted: (at c s21)
   added: (at c s22)
   goals met: 1 of 2
6. (move c s22 s23)
   deleted: (at c s22)
   added: (at c s23)
   goals met: 1 of 2
7. (move c s23 s24)
   deleted: (at c s23)
   added: (at c s24)
   goals met: 1 of 2
8. (eat c s24 m2)
   deleted: (at m2 s24)
   added: (dead m2)
   goals met: 2 of 2
